<a href="https://colab.research.google.com/github/manis12312/Manish/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame({'From_To':['LoNDon_paris','MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis','Brussels_londOn'],'FlightNumber':[10045,np.nan,10065,np.nan,10085],'RecentDelay':[[23,47],[],[24,43,87],[13],[67,32]]})

In [3]:
df

            From_To  FlightNumber   RecentDelay
0      LoNDon_paris       10045.0      [23, 47]
1      MAdrid_miLAN           NaN            []
2  londON_StockhOlm       10065.0  [24, 43, 87]
3    Budapest_PaRis           NaN          [13]
4   Brussels_londOn       10085.0      [67, 32]

In [4]:
temp=df

In [5]:
temp

            From_To  FlightNumber   RecentDelay
0      LoNDon_paris       10045.0      [23, 47]
1      MAdrid_miLAN           NaN            []
2  londON_StockhOlm       10065.0  [24, 43, 87]
3    Budapest_PaRis           NaN          [13]
4   Brussels_londOn       10085.0      [67, 32]

In [6]:
temp['From']=[i.split('_')[0] for i in temp['From_To']]

In [7]:
temp['To']=[i.split('_')[1] for i in temp['From_To']]

In [8]:
temp.drop('From_To',axis=1,inplace=True)

In [9]:
temp

   FlightNumber   RecentDelay      From         To
0       10045.0      [23, 47]    LoNDon      paris
1           NaN            []    MAdrid      miLAN
2       10065.0  [24, 43, 87]    londON  StockhOlm
3           NaN          [13]  Budapest      PaRis
4       10085.0      [67, 32]  Brussels     londOn

In [10]:
temp['From']=temp['From'].str.capitalize()
temp['To']=temp['To'].str.capitalize()
#temp['From']=temp['From'].str.capitalize()

In [11]:
temp

   FlightNumber   RecentDelay      From         To
0       10045.0      [23, 47]    London      Paris
1           NaN            []    Madrid      Milan
2       10065.0  [24, 43, 87]    London  Stockholm
3           NaN          [13]  Budapest      Paris
4       10085.0      [67, 32]  Brussels     London

In [12]:
temp['FlightNumber']=temp['FlightNumber'].interpolate().astype(int)

In [13]:
temp

   FlightNumber   RecentDelay      From         To
0         10045      [23, 47]    London      Paris
1         10055            []    Madrid      Milan
2         10065  [24, 43, 87]    London  Stockholm
3         10075          [13]  Budapest      Paris
4         10085      [67, 32]  Brussels     London

In [54]:
delays=pd.DataFrame(temp['RecentDelay'])

In [55]:
delays=delays['RecentDelay'].apply(pd.Series)

In [56]:
delays=delays.rename(columns=(lambda x:'Delays_'+str(x)))

In [57]:
delays

   Delays_0  Delays_1  Delays_2
0      23.0      47.0       NaN
1       NaN       NaN       NaN
2      24.0      43.0      87.0
3      13.0       NaN       NaN
4      67.0      32.0       NaN